#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_lambda_layer_version.visitors_app_layer: Refreshing state... [id=arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:19]
aws_api_gateway_rest_api.visitors_rest_api: Refreshing state... [id=wvmekkxrt8]
aws_dynamodb_table.visitors_app_table: Refreshing state... [id=Visitors]
aws_iam_role.lambda_cust_role: Refreshing state... [id=lambda_cust_role]
aws_iam_role_policy.lambda_cust_policy: Refreshing state... [id=lambda_cust_role:lambda_cust_policy]
aws_lambda_function.visitorsapp: Refreshing state... [id=visitorsapp]
aws_api_gateway_resource.visitors_app_proxy: Refreshing state... [id=73931p]
aws_lambda_permission.visitors_apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_method.visitors_gateway_proxy: Refreshing state... [id=agm-wvmekkxrt8-73931p-ANY]
aws_api_gateway_integration.visitors_app_lambda: Refreshing state... [id=agi-wvmekkxrt8-73931p-ANY]
aws_api_gateway_deployment.visitors_app_api_gateway_deploy: Refreshing state... [id=cmfjnt]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.visitorsapp will be updated in-place
  ~ resource "aws_lambda_function" "visitorsapp" {
        id                             = "visitorsapp"
      ~ last_modified                  = "2021-03-06T01:55:14.701+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:19",
        ] -> (known after apply)
      ~ source_code_hash               = "ZxaVYh+u5W0SensA2DBaiLAX02L1QFNCN6XFDZxBPKA=" -> "Yd6Bs1LjDHvNfb7wBPrIuQYVTK/UC1m/SyBwq4KwR4E="
        tags                           = {}
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.visitors_app_layer must be replaced
-/+ resource "aws_lambda_layer_version" "visitors_app_layer" {
      ~ arn                 = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:19" -> (known after apply)
      ~ created_date        = "2021-03-06T01:55:05.782+0000" -> (known after apply)
      ~ id                  = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:19" -> (known after apply)
      ~ layer_arn           = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer" -> (known after apply)
      ~ source_code_hash    = "21pDGxJDGKCKlpVLFjwS9ifANb++GutRxsMd2p1/UBU=" -> "86dQUvxz9qadbu9cjoNquBVDNov1eHCIhw/PECedUKk=" # forces replacement
      ~ source_code_size    = 20398430 -> (known after apply)
      ~ version             = "19" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @lebergarrett, Action: `pull_request`*